# Dotfiles Brewfile
# Install: brew bundle --file=Brewfile
# Check:   brew bundle check --file=Brewfile

# CLI tools
brew "gh"
brew "jq"
brew "tree"
brew "btop"
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "gum"
brew "starship"
brew "zoxide"

# Python toolchain
brew "pyenv"
brew "uv"
brew "ruff"

# Hermes Agent dependencies
brew "espeak-ng"
brew "ffmpeg"

# macOS apps (casks)
cask "stats"
